KISPE-Harvey/kispe-boardmanager/rp2040/0.0.1/boards.txt
# -----------------------------------
#   KISPE Motor Board RP2040
# -----------------------------------
MBoard.name=Motor Board
MBoard.vid.0=0x2e8a
MBoard.pid.0=0xf00a
MBoard.vid.1=0x2e8a
MBoard.pid.1=0xf10a
MBoard.upload_port.0.vid=0x2e8a
MBoard.upload_port.0.pid=0xf00a
MBoard.upload_port.1.vid=0x2e8a
MBoard.upload_port.1.pid=0xf10a
MBoard.build.usbvid=-DUSBD_VID=0x2e8a
MBoard.build.usbpid=-DUSBD_PID=0xf00a
MBoard.build.usbpwr=-DUSBD_MAX_POWER_MA=250
MBoard.build.board=GENERIC_RP2040
MBoard.build.mcu=cortex-m0plus
MBoard.build.variant=generic
MBoard.upload.maximum_size=16777216
MBoard.upload.wait_for_upload_port=true
MBoard.upload.erase_cmd=
MBoard.serial.disableDTR=false
MBoard.serial.disableRTS=false
MBoard.build.f_cpu=125000000
MBoard.build.led=
MBoard.build.core=rp2040
MBoard.build.ldscript=memmap_default.ld
MBoard.build.boot2=boot2_generic_03h_4_padded_checksum
MBoard.build.usb_manufacturer="Motor Board"
MBoard.build.usb_product="RP2040"
MBoard.menu.flash.2097152_0=2MB (no FS)
MBoard.menu.flash.2097152_0.upload.maximum_size=2093056
MBoard.menu.flash.2097152_0.build.flash_total=2097152
MBoard.menu.flash.2097152_0.build.flash_length=2093056
MBoard.menu.flash.2097152_0.build.eeprom_start=270528512
MBoard.menu.flash.2097152_0.build.fs_start=270528512
MBoard.menu.flash.2097152_0.build.fs_end=270528512
MBoard.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
MBoard.menu.flash.2097152_1048576.upload.maximum_size=1044480
MBoard.menu.flash.2097152_1048576.build.flash_total=2097152
MBoard.menu.flash.2097152_1048576.build.flash_length=1044480
MBoard.menu.flash.2097152_1048576.build.eeprom_start=270528512
MBoard.menu.flash.2097152_1048576.build.fs_start=269479936
MBoard.menu.flash.2097152_1048576.build.fs_end=270528512
MBoard.menu.flash.4194304_0=4MB (no FS)
MBoard.menu.flash.4194304_0.upload.maximum_size=4190208
MBoard.menu.flash.4194304_0.build.flash_total=4194304
MBoard.menu.flash.4194304_0.build.flash_length=4190208
MBoard.menu.flash.4194304_0.build.eeprom_start=272625664
MBoard.menu.flash.4194304_0.build.fs_start=272625664
MBoard.menu.flash.4194304_0.build.fs_end=272625664
MBoard.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
MBoard.menu.flash.4194304_3145728.upload.maximum_size=1044480
MBoard.menu.flash.4194304_3145728.build.flash_total=4194304
MBoard.menu.flash.4194304_3145728.build.flash_length=1044480
MBoard.menu.flash.4194304_3145728.build.eeprom_start=272625664
MBoard.menu.flash.4194304_3145728.build.fs_start=269479936
MBoard.menu.flash.4194304_3145728.build.fs_end=272625664
MBoard.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
MBoard.menu.flash.4194304_2097152.upload.maximum_size=2093056
MBoard.menu.flash.4194304_2097152.build.flash_total=4194304
MBoard.menu.flash.4194304_2097152.build.flash_length=2093056
MBoard.menu.flash.4194304_2097152.build.eeprom_start=272625664
MBoard.menu.flash.4194304_2097152.build.fs_start=270528512
MBoard.menu.flash.4194304_2097152.build.fs_end=272625664
MBoard.menu.flash.8388608_0=8MB (no FS)
MBoard.menu.flash.8388608_0.upload.maximum_size=8384512
MBoard.menu.flash.8388608_0.build.flash_total=8388608
MBoard.menu.flash.8388608_0.build.flash_length=8384512
MBoard.menu.flash.8388608_0.build.eeprom_start=276819968
MBoard.menu.flash.8388608_0.build.fs_start=276819968
MBoard.menu.flash.8388608_0.build.fs_end=276819968
MBoard.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
MBoard.menu.flash.8388608_7340032.upload.maximum_size=1044480
MBoard.menu.flash.8388608_7340032.build.flash_total=8388608
MBoard.menu.flash.8388608_7340032.build.flash_length=1044480
MBoard.menu.flash.8388608_7340032.build.eeprom_start=276819968
MBoard.menu.flash.8388608_7340032.build.fs_start=269479936
MBoard.menu.flash.8388608_7340032.build.fs_end=276819968
MBoard.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
MBoard.menu.flash.8388608_4194304.upload.maximum_size=4190208
MBoard.menu.flash.8388608_4194304.build.flash_total=8388608
MBoard.menu.flash.8388608_4194304.build.flash_length=4190208
MBoard.menu.flash.8388608_4194304.build.eeprom_start=276819968
MBoard.menu.flash.8388608_4194304.build.fs_start=272625664
MBoard.menu.flash.8388608_4194304.build.fs_end=276819968
MBoard.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
MBoard.menu.flash.8388608_2097152.upload.maximum_size=6287360
MBoard.menu.flash.8388608_2097152.build.flash_total=8388608
MBoard.menu.flash.8388608_2097152.build.flash_length=6287360
MBoard.menu.flash.8388608_2097152.build.eeprom_start=276819968
MBoard.menu.flash.8388608_2097152.build.fs_start=274722816
MBoard.menu.flash.8388608_2097152.build.fs_end=276819968
MBoard.menu.flash.16777216_0=16MB (no FS)
MBoard.menu.flash.16777216_0.upload.maximum_size=16773120
MBoard.menu.flash.16777216_0.build.flash_total=16777216
MBoard.menu.flash.16777216_0.build.flash_length=16773120
MBoard.menu.flash.16777216_0.build.eeprom_start=285208576
MBoard.menu.flash.16777216_0.build.fs_start=285208576
MBoard.menu.flash.16777216_0.build.fs_end=285208576
MBoard.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
MBoard.menu.flash.16777216_15728640.upload.maximum_size=1044480
MBoard.menu.flash.16777216_15728640.build.flash_total=16777216
MBoard.menu.flash.16777216_15728640.build.flash_length=1044480
MBoard.menu.flash.16777216_15728640.build.eeprom_start=285208576
MBoard.menu.flash.16777216_15728640.build.fs_start=269479936
MBoard.menu.flash.16777216_15728640.build.fs_end=285208576
MBoard.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
MBoard.menu.flash.16777216_14680064.upload.maximum_size=2093056
MBoard.menu.flash.16777216_14680064.build.flash_total=16777216
MBoard.menu.flash.16777216_14680064.build.flash_length=2093056
MBoard.menu.flash.16777216_14680064.build.eeprom_start=285208576
MBoard.menu.flash.16777216_14680064.build.fs_start=270528512
MBoard.menu.flash.16777216_14680064.build.fs_end=285208576
MBoard.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
MBoard.menu.flash.16777216_12582912.upload.maximum_size=4190208
MBoard.menu.flash.16777216_12582912.build.flash_total=16777216
MBoard.menu.flash.16777216_12582912.build.flash_length=4190208
MBoard.menu.flash.16777216_12582912.build.eeprom_start=285208576
MBoard.menu.flash.16777216_12582912.build.fs_start=272625664
MBoard.menu.flash.16777216_12582912.build.fs_end=285208576
MBoard.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
MBoard.menu.flash.16777216_8388608.upload.maximum_size=8384512
MBoard.menu.flash.16777216_8388608.build.flash_total=16777216
MBoard.menu.flash.16777216_8388608.build.flash_length=8384512
MBoard.menu.flash.16777216_8388608.build.eeprom_start=285208576
MBoard.menu.flash.16777216_8388608.build.fs_start=276819968
MBoard.menu.flash.16777216_8388608.build.fs_end=285208576
MBoard.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
MBoard.menu.flash.16777216_4194304.upload.maximum_size=12578816
MBoard.menu.flash.16777216_4194304.build.flash_total=16777216
MBoard.menu.flash.16777216_4194304.build.flash_length=12578816
MBoard.menu.flash.16777216_4194304.build.eeprom_start=285208576
MBoard.menu.flash.16777216_4194304.build.fs_start=281014272
MBoard.menu.flash.16777216_4194304.build.fs_end=285208576
MBoard.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
MBoard.menu.flash.16777216_2097152.upload.maximum_size=14675968
MBoard.menu.flash.16777216_2097152.build.flash_total=16777216
MBoard.menu.flash.16777216_2097152.build.flash_length=14675968
MBoard.menu.flash.16777216_2097152.build.eeprom_start=285208576
MBoard.menu.flash.16777216_2097152.build.fs_start=283111424
MBoard.menu.flash.16777216_2097152.build.fs_end=285208576
MBoard.menu.freq.133=133 MHz
MBoard.menu.freq.133.build.f_cpu=133000000L
MBoard.menu.freq.50=50 MHz
MBoard.menu.freq.50.build.f_cpu=50000000L
MBoard.menu.freq.100=100 MHz
MBoard.menu.freq.100.build.f_cpu=100000000L
MBoard.menu.freq.120=120 MHz
MBoard.menu.freq.120.build.f_cpu=120000000L
MBoard.menu.freq.125=125 MHz
MBoard.menu.freq.125.build.f_cpu=125000000L
MBoard.menu.freq.128=128 MHz
MBoard.menu.freq.128.build.f_cpu=128000000L
MBoard.menu.freq.150=150 MHz (Overclock)
MBoard.menu.freq.150.build.f_cpu=150000000L
MBoard.menu.freq.175=175 MHz (Overclock)
MBoard.menu.freq.175.build.f_cpu=175000000L
MBoard.menu.freq.200=200 MHz (Overclock)
MBoard.menu.freq.200.build.f_cpu=200000000L
MBoard.menu.freq.225=225 MHz (Overclock)
MBoard.menu.freq.225.build.f_cpu=225000000L
MBoard.menu.freq.240=240 MHz (Overclock)
MBoard.menu.freq.240.build.f_cpu=240000000L
MBoard.menu.freq.250=250 MHz (Overclock)
MBoard.menu.freq.250.build.f_cpu=250000000L
MBoard.menu.freq.275=275 MHz (Overclock)
MBoard.menu.freq.275.build.f_cpu=275000000L
MBoard.menu.freq.300=300 MHz (Overclock)
MBoard.menu.freq.300.build.f_cpu=300000000L
MBoard.menu.opt.Small=Small (-Os) (standard)
MBoard.menu.opt.Small.build.flags.optimize=-Os
MBoard.menu.opt.Optimize=Optimize (-O)
MBoard.menu.opt.Optimize.build.flags.optimize=-O
MBoard.menu.opt.Optimize2=Optimize More (-O2)
MBoard.menu.opt.Optimize2.build.flags.optimize=-O2
MBoard.menu.opt.Optimize3=Optimize Even More (-O3)
MBoard.menu.opt.Optimize3.build.flags.optimize=-O3
MBoard.menu.opt.Fast=Fast (-Ofast) (maybe slower)
MBoard.menu.opt.Fast.build.flags.optimize=-Ofast
MBoard.menu.opt.Debug=Debug (-Og)
MBoard.menu.opt.Debug.build.flags.optimize=-Og
MBoard.menu.rtti.Disabled=Disabled
MBoard.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
MBoard.menu.rtti.Enabled=Enabled
MBoard.menu.rtti.Enabled.build.flags.rtti=
MBoard.menu.stackprotect.Disabled=Disabled
MBoard.menu.stackprotect.Disabled.build.flags.stackprotect=
MBoard.menu.stackprotect.Enabled=Enabled
MBoard.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
MBoard.menu.exceptions.Disabled=Disabled
MBoard.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
MBoard.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
MBoard.menu.exceptions.Enabled=Enabled
MBoard.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
MBoard.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
MBoard.menu.dbgport.Disabled=Disabled
MBoard.menu.dbgport.Disabled.build.debug_port=
MBoard.menu.dbgport.Serial=Serial
MBoard.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
MBoard.menu.dbgport.Serial1=Serial1
MBoard.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
MBoard.menu.dbgport.Serial2=Serial2
MBoard.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
MBoard.menu.dbglvl.None=None
MBoard.menu.dbglvl.None.build.debug_level=
MBoard.menu.dbglvl.Core=Core
MBoard.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
MBoard.menu.dbglvl.SPI=SPI
MBoard.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
MBoard.menu.dbglvl.Wire=Wire
MBoard.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
MBoard.menu.dbglvl.Bluetooth=Bluetooth
MBoard.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
MBoard.menu.dbglvl.All=All
MBoard.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
MBoard.menu.dbglvl.NDEBUG=NDEBUG
MBoard.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
MBoard.menu.usbstack.picosdk=Pico SDK
MBoard.menu.usbstack.picosdk.build.usbstack_flags=
MBoard.menu.usbstack.tinyusb=Adafruit TinyUSB
MBoard.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
MBoard.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
MBoard.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
MBoard.menu.usbstack.nousb=No USB
MBoard.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
MBoard.menu.ipbtstack.ipv4only=IPv4 Only
MBoard.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
MBoard.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
MBoard.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
MBoard.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
MBoard.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
MBoard.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
MBoard.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
MBoard.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
MBoard.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
MBoard.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
MBoard.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
MBoard.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
MBoard.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
MBoard.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
MBoard.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
MBoard.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
MBoard.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
MBoard.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
MBoard.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
MBoard.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
MBoard.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
MBoard.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
MBoard.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
MBoard.menu.boot2.boot2_generic_03h_2_padded_checksum=Generic SPI /2
MBoard.menu.boot2.boot2_generic_03h_2_padded_checksum.build.boot2=boot2_generic_03h_2_padded_checksum
MBoard.menu.boot2.boot2_generic_03h_4_padded_checksum=Generic SPI /4
MBoard.menu.boot2.boot2_generic_03h_4_padded_checksum.build.boot2=boot2_generic_03h_4_padded_checksum
MBoard.menu.boot2.boot2_is25lp080_2_padded_checksum=IS25LP080 QSPI /2
MBoard.menu.boot2.boot2_is25lp080_2_padded_checksum.build.boot2=boot2_is25lp080_2_padded_checksum
MBoard.menu.boot2.boot2_is25lp080_4_padded_checksum=IS25LP080 QSPI /4
MBoard.menu.boot2.boot2_is25lp080_4_padded_checksum.build.boot2=boot2_is25lp080_4_padded_checksum
MBoard.menu.boot2.boot2_w25q080_2_padded_checksum=W25Q080 QSPI /2
MBoard.menu.boot2.boot2_w25q080_2_padded_checksum.build.boot2=boot2_w25q080_2_padded_checksum
MBoard.menu.boot2.boot2_w25q080_4_padded_checksum=W25Q080 QSPI /4
MBoard.menu.boot2.boot2_w25q080_4_padded_checksum.build.boot2=boot2_w25q080_4_padded_checksum
MBoard.menu.boot2.boot2_w25x10cl_2_padded_checksum=W25X10CL QSPI /2
MBoard.menu.boot2.boot2_w25x10cl_2_padded_checksum.build.boot2=boot2_w25x10cl_2_padded_checksum
MBoard.menu.boot2.boot2_w25x10cl_4_padded_checksum=W25X10CL QSPI /4
MBoard.menu.boot2.boot2_w25x10cl_4_padded_checksum.build.boot2=boot2_w25x10cl_4_padded_checksum
MBoard.menu.boot2.boot2_w25q64jv_4_padded_checksum=W25Q64JV QSPI /4
MBoard.menu.boot2.boot2_w25q64jv_4_padded_checksum.build.boot2=boot2_w25q64jv_4_padded_checksum
MBoard.menu.boot2.boot2_w25q16jvxq_4_padded_checksum=W25Q16JVxQ QSPI /4
MBoard.menu.boot2.boot2_w25q16jvxq_4_padded_checksum.build.boot2=boot2_w25q16jvxq_4_padded_checksum
MBoard.menu.boot2.boot2_w25q128jvxq_4_padded_checksum=W25Q128JV QSPI /4
MBoard.menu.boot2.boot2_w25q128jvxq_4_padded_checksum.build.boot2=boot2_w25q128jvxq_4_padded_checksum
MBoard.menu.uploadmethod.default=Default (UF2)
MBoard.menu.uploadmethod.default.build.ram_length=256k
MBoard.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
MBoard.menu.uploadmethod.default.upload.maximum_data_size=262144
MBoard.menu.uploadmethod.default.upload.tool=uf2conv
MBoard.menu.uploadmethod.default.upload.tool.default=uf2conv
MBoard.menu.uploadmethod.default.upload.tool.network=uf2conv-network
MBoard.menu.uploadmethod.picotool=Picotool
MBoard.menu.uploadmethod.picotool.build.ram_length=256k
MBoard.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
MBoard.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
MBoard.menu.uploadmethod.picotool.upload.maximum_data_size=262144
MBoard.menu.uploadmethod.picotool.upload.tool=picotool
MBoard.menu.uploadmethod.picotool.upload.tool.default=picotool
MBoard.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
MBoard.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
MBoard.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
MBoard.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
MBoard.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
MBoard.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
MBoard.menu.uploadmethod.picodebug=Pico-Debug
MBoard.menu.uploadmethod.picodebug.build.ram_length=240k
MBoard.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
MBoard.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
MBoard.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
MBoard.menu.uploadmethod.picodebug.upload.tool=picodebug
MBoard.menu.uploadmethod.picodebug.upload.tool.default=picodebug